set_property IOSTANDARD LVCMOS18 [get_ports {counter[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {counter[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {counter[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {counter[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports clk_in]
set_property IOSTANDARD LVCMOS18 [get_ports data_in]
set_property IOSTANDARD LVCMOS18 [get_ports mode]
set_property IOSTANDARD LVCMOS18 [get_ports parity_ok]
set_property IOSTANDARD LVCMOS18 [get_ports reset]
set_property IOSTANDARD LVCMOS18 [get_ports valid]
set_property PACKAGE_PIN U14 [get_ports {counter[3]}]
set_property PACKAGE_PIN U19 [get_ports {counter[2]}]
set_property PACKAGE_PIN W22 [get_ports {counter[1]}]
set_property PACKAGE_PIN V22 [get_ports {counter[0]}]
set_property PACKAGE_PIN Y9 [get_ports clk_in]
set_property PACKAGE_PIN M15 [get_ports data_in]
set_property PACKAGE_PIN H18 [get_ports mode]
set_property PACKAGE_PIN T22 [get_ports parity_ok]
set_property PACKAGE_PIN H17 [get_ports reset]
set_property PACKAGE_PIN H19 [get_ports valid]
create_clock -period 10.000 -name clk_in -waveform {0.000 5.000} [get_ports clk_in]
create_generated_clock -name clk_div/CLK -source [get_ports clk_in] -divide_by 100000000 [get_pins clk_div/clk_reg/Q]
create_clock -period 1000000000.000 -name VIRTUAL_clk_div/CLK -waveform {0.000 500000000.000}
set_input_delay -clock [get_clocks VIRTUAL_clk_div/CLK] -min -add_delay 2.000 [get_ports data_in]
set_input_delay -clock [get_clocks VIRTUAL_clk_div/CLK] -max -add_delay 2.000 [get_ports data_in]
set_input_delay -clock [get_clocks VIRTUAL_clk_div/CLK] -min -add_delay 2.000 [get_ports mode]
set_input_delay -clock [get_clocks VIRTUAL_clk_div/CLK] -max -add_delay 2.000 [get_ports mode]
set_input_delay -clock [get_clocks VIRTUAL_clk_div/CLK] -min -add_delay 2.000 [get_ports reset]
set_input_delay -clock [get_clocks VIRTUAL_clk_div/CLK] -max -add_delay 2.000 [get_ports reset]
set_input_delay -clock [get_clocks clk_in] -min -add_delay 2.000 [get_ports reset]
set_input_delay -clock [get_clocks clk_in] -max -add_delay 2.000 [get_ports reset]
set_input_delay -clock [get_clocks VIRTUAL_clk_div/CLK] -min -add_delay 2.000 [get_ports valid]
set_input_delay -clock [get_clocks VIRTUAL_clk_div/CLK] -max -add_delay 2.000 [get_ports valid]
set_output_delay -clock [get_clocks VIRTUAL_clk_div/CLK] -min -add_delay 0.000 [get_ports {counter[*]}]
set_output_delay -clock [get_clocks VIRTUAL_clk_div/CLK] -max -add_delay 2.000 [get_ports {counter[*]}]
set_output_delay -clock [get_clocks VIRTUAL_clk_div/CLK] -min -add_delay 0.000 [get_ports parity_ok]
set_output_delay -clock [get_clocks VIRTUAL_clk_div/CLK] -max -add_delay 2.000 [get_ports parity_ok]
